app/Validation/CustomRules.php

  public function email_estado($userEmail){

    $usuario = new UsuarioModel();
    $persona = new PersonaModel();
    $p = $persona->where('email', $userEmail)->first();
    $u = $usuario->where('id_persona',$p['id_persona'])->where('activo', 1)->first();
---
SELECT *
FROM `personas`
WHERE `email` = 'mati.j.martinez@gmail.com'
 LIMIT 1
SELECT *
FROM `usuarios`
WHERE `id_persona` = '13'
AND `activo` = 1
 LIMIT 1