app/Filters/CheckAdminFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        if(!session()->has('loggedUser'))
        {
            return redirect()->to(route_to('login'))->with('fail', 'Necesitas iniciar sesion para acceder');
        }

        $item = $_SESSION;
        //dd($item);
        //dd($item['loggedUser']); //VEMOS LO QUE TRAE LA VARIABLE

        $datosUsuarios = new UsuarioModel();

        //Buscamos en el objeto USUARIO el ID de la persona => Se convierte en un Array
        $info_usuario = $datosUsuarios->where( 'id_persona', $item['loggedUser'])->findAll();
---
SELECT *
FROM `usuarios`
WHERE `id_persona` = '13'