app/Controllers/AuthController.php

SELECT *
FROM `personas`
WHERE `email` = 'mati.j.martinez@gmail.com'
 LIMIT 1
SELECT *
FROM `usuarios`
WHERE `id_persona` = '13'
 LIMIT 1
---
            $tablaPersonaModelo = new PersonaModel();

            //Ponemos en una variable a la persona que obtenemos en una busqueda en la BD
            $informacion_persona_logueada = $tablaPersonaModelo->where('email', $email)->first();
            //Ponemos en una variable al usuario relacionado con el ID de la persona
            $info_usuario_logueado = $tablaUsuariosModelo->where('id_persona', $informacion_persona_logueada['id_persona'])->first();

SELECT *
FROM `consultas`
WHERE `leido` = 0
---
                if($info_usuario_logueado['id_rol'] == 1)
                {
                    $consulta = new ConsultaModel();
                    $asociar = [
                        'consultas' => $consulta->where('leido', 0)->findAll(),
                    ];