app/Controllers/CatalogoController.php

    public function index()
    {
        //Creamos el objeto de la Tabla Productos
        $productos = new ProductoModel();
        $categorias = new CategoriasModel();
        $numFiltro = 0;

        $DatosProductos = $productos->orderBy('id_producto', 'DESC')
                            ->where('activo', 1)->where('cantidad >', 0)
                            ->findAll();
        //$DatosProductos = $productos->orderBy('id_producto', 'ASC')->where('activo', 0)->findAll();

        $data = [
            'productos' => $DatosProductos,
            'categorias' => $categorias->findAll(),
---
SELECT *
FROM `productos`
WHERE `activo` = 1
AND `cantidad` > 0
ORDER BY `id_producto` DESC
SELECT *
FROM `categorias`
WHERE `activo` = 1

    public function buscarProducto()
    {
        $productos = new ProductoModel();
        $categorias = new CategoriasModel();

        $nombre = $this->request->getPost('nombre');

        //$encontrado = $producto->where('nombre_producto', $nombre)->findAll();
        $encontrado = $productos->orderBy('id_producto', 'DESC')
                            ->where('activo', 1)->like('nombre_producto', $nombre)
                            ->findAll();

        $data = [
            'productos' => $encontrado,
            'categorias' => $categorias->findAll(),
            'numFiltro' => 0,
            ];
---
SELECT *
FROM `categorias`
WHERE `activo` = 1
SELECT *
FROM `productos`
WHERE `activo` = 1
AND  `nombre_producto` LIKE '%RJ-MANG%' ESCAPE '!'
ORDER BY `id_producto` DESC