app/Controllers/CategoriaController.php

    public function buscarCategoriasActivas()
    {
        //Creamos el objeto de la Tabla Categorias
        $categorias = new CategoriasModel();
        $nombre = $this->request->getPost('nombre');
        $encontrado = $categorias->where('activo', 1)->like('nombre_categoria', $nombre)->findAll();
---
SELECT *
FROM `categorias`
WHERE `activo` = 1
AND  `nombre_categoria` LIKE '%%' ESCAPE '!'