app/Controllers/ConsultaController.php

    public function listaConsultas()
    {
        $consultas = new ConsultaModel();

        $listaConsultas = $consultas->findAll();
---
SELECT *
FROM `consultas`