app/Controllers/FacturaController.php

SELECT *
FROM `usuarios`
WHERE `id_rol` = 2
SELECT *
FROM `personas`
SELECT *
FROM `facturas`
SELECT *
FROM `detallesfacturas`
SELECT *
FROM `productos`
---
    public function allFacturas()
    {
        $usuarios = new UsuarioModel();
        $personas = new PersonaModel();
        $facturas = new FacturaModel();
        $detallesFacturas = new DetalleFacturaModel();
        $productos = new ProductoModel();

        $datos = [
            'usuarios' => $usuarios->where('id_rol', 2)->findAll(),
            'personas' => $personas->findAll(),
            'facturas' => $facturas->findAll(),
            'detallesFacturas' => $detallesFacturas->findAll(),
            'productos' => $productos->findAll(),
        ];

SELECT *
FROM `facturas`
WHERE `id_usuario` = '12'
SELECT *
FROM `productos`
---
    public function allFacturasUsuario()
    {
        $facturas = new FacturaModel();
        $detallesFacturas = new DetalleFacturaModel();
        $productos = new ProductoModel();

        $misFacturas = $facturas->where('id_usuario', session()->get('id_usuario'))->findAll();
        $misDetallesFactura = array();


        foreach ($misFacturas as $key => $value) {

            foreach ($detallesFacturas->where('id_factura', $value['id_factura'])->findAll() as $keyD => $valueD) {

                if($value['id_factura'] == $valueD['id_factura'])
                {
                    array_push($misDetallesFactura, $valueD);
                }
            }
        }

        $datos = [
            'facturas' => $misFacturas,
            'detallesFacturas' => $misDetallesFactura,
            'productos' => $productos->findAll(),

SELECT *
FROM `facturas`
WHERE `id_factura` = '20'
 LIMIT 1
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '18'
 LIMIT 1
SELECT *
FROM `personas`
WHERE `id_persona` = '21'
 LIMIT 1
SELECT *
FROM `productos`
---
    public function facturaUnica($id=null)
    {
        $usuario = new UsuarioModel();
        $persona = new PersonaModel();
        $productos = new ProductoModel();
        $domicilio = new DomicilioModel();
        $factura = new FacturaModel();
        $detalleFactura = new DetalleFacturaModel();

        $facturaUsuario = $factura->where('id_factura', $id)->first();
        $usuarioElegido = $usuario->where('id_usuario', $facturaUsuario['id_usuario'])->first();
        $personaElegida = $persona->where('id_persona', $usuarioElegido['id_persona'])->first();
        $detallesElegidos = $detalleFactura->where('id_factura', $id)->findAll();
        $allProductos = $productos->findAll();

SELECT *
FROM `domicilios`
WHERE `id_domicilio` = '41'
 LIMIT 1
---
            }
        }

        $domicilioUsuario = $domicilio->where('id_domicilio', $personaElegida['id_domicilio'])->first();