app/Controllers/HomeController.php

    public function index()
    {
        //Creamos el objeto de la Tabla Usuarios
        $datosUsuarios = new UsuarioModel();
        $datosPersona = new PersonaModel();

        //Capturamos el ID del logueo de la PERSONA reciente
        $id_persona_logueada = session()->get('loggedUser');

        if(session()->has('loggedUser'))
        {
            //Buscamos en el objeto USUARIO el ID de la persona => Se convierte en un Array
            $info_usuario = $datosUsuarios->where('id_persona',$id_persona_logueada)->first();
            //Buscamos en el objeto a la PERSONA logueada
            $info_persona = $datosPersona->find($id_persona_logueada);
---
SELECT *
FROM `personas`
WHERE `personas`.`id_persona` = '15'
SELECT *
FROM `usuarios`
WHERE `id_persona` = '15'
 LIMIT 1

    public function indexAdmin()
    {
        //Creamos el objeto de la Tabla Usuarios
        $datosUsuarios = new UsuarioModel();
        $datosPersona = new PersonaModel();

        //Capturamos el ID del logueo de la PERSONA reciente
        $id_persona_logueada = session()->get('loggedUser');

        if(session()->has('loggedUser'))
        {
            //Buscamos en el objeto USUARIO el ID de la persona => Se convierte en un Array
            $info_usuario = $datosUsuarios->where('id_persona',$id_persona_logueada)->first();
            //Buscamos en el objeto a la PERSONA logueada
            $info_persona = $datosPersona->find($id_persona_logueada);
---
SELECT *
FROM `usuarios`
WHERE `id_persona` = '13'
 LIMIT 1
SELECT *
FROM `personas`
WHERE `personas`.`id_persona` = '13'