app/Controllers/HomeController.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '25'
---
    public function index()
    {
        //Creamos el objeto de la Tabla Usuarios
        $datosUsuarios = new UsuarioModel();

        //Capturamos el ID del logueo del usuario reciente
        $id_usuario_logueado = session()->get('loggedUser');

        //Buscamos en el objeto al usuario logueado
        $info_usuario = $datosUsuarios->find($id_usuario_logueado);

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '25'
SELECT *
FROM `usuarios`
---
    public function verUsuarios()
    {
        //Creamos el objeto de la Tabla Usuarios
        $datosUsuarios = new UsuarioModel();

        //Capturamos el ID del logueo del usuario reciente
        $id_usuario_logueado = session()->get('loggedUser');

        //Buscamos en el objeto al usuario logueado
        $info_usuario = $datosUsuarios->find($id_usuario_logueado);

        //Tambien capturamos todos los datos de la tabla de usuarios
        $info_tabla_usuarios = $datosUsuarios->findAll();