app/Controllers/ProductoController.php

    public function crearProducto()
    {
        $datosCategoria = new CategoriasModel();

        $data = [
            'categorias' => $datosCategoria->findAll(),
        ];
---
SELECT *
FROM `categorias`

    public function editarProducto($id=null)
    {
        $productos = new ProductoModel();
        $datosCategoria = new CategoriasModel();

        $DatosProductos = $productos->where('id_producto', $id)->first();


        $datos = [
            'producto' => $DatosProductos,
            'categorias' => $datosCategoria->findAll(),
            'categoriaEditar' => $datosCategoria->where('id_categoria',$DatosProductos['id_categoria'])->first()
        ];
---
SELECT *
FROM `productos`
WHERE `id_producto` = '21'
 LIMIT 1
SELECT *
FROM `categorias`
WHERE `id_categoria` = '3'
 LIMIT 1
SELECT *
FROM `categorias`

    public function carrito($id=null)
    {
        $producto = new ProductoModel();
        $elegido = $producto->where('id_producto', $id)->first();
---
SELECT *
FROM `productos`
WHERE `id_producto` = '14'
 LIMIT 1

            session()->set(array_merge(session()->get(),$asociar));
        }
        //Actualizamos la cantidad del producto con la variable $datos=(cantidadEnLaBD - 1)
        $producto->where('id_producto', $id)->update($id,$datos);
---
UPDATE `productos` SET `cantidad` = 2
WHERE `id_producto` = '14'
AND `productos`.`id_producto` IN ('14')

    public function indexCompras()
    {
        $productos = new ProductoModel();
        $data = [
            'productosBD' => $productos->where('activo', 1)->findAll()
        ];
---
SELECT *
FROM `productos`
WHERE `activo` = 1