app/Controllers/UsuarioController.php

SELECT *
FROM `usuarios`
WHERE `activo` = 0
AND `id_rol` = 2
SELECT *
FROM `personas`
---
    public function usuariosInActivos()
    {
        $datosUsuarios = new UsuarioModel();
        $datosPersonas = new PersonaModel();

        //Metemos a todos los usuarios en un ARRAY
        $info_usuario = $datosUsuarios->where('activo', 0)->where('id_rol', 2)->findAll();
        $info_persona = $datosPersonas->findAll();